cf/Catalogs/Напоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Напоминания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеОткрыто</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеОткрыл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/ПериодыНапоминаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПериодыНапоминаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>_10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_30</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_60</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_180</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завтра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСледующейНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСледующемМесяце</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВНовомГоду</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/Напоминания/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем НапоминанияБольшеНет;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// зАПИШЕМ ЧТО НАПОМИНАНИЕ ОТКРЫЛИ
	
	Если Не ЗаписатьОткрытие() Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
	СледующееНапоминание = ТекущаяДата();
	
	Заголовок = Объект.Источник;
	НапомнитЕщеРаз = Перечисления.ПериодыНапоминаний._10;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	// Запишем что напоминание закрыли
	
	Если НапоминанияБольшеНет <> Истина Тогда
		
		ЗаписатьНапоминание();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьВремяСледующегоНапоминания()
	
	Если НапомнитЕщеРаз = Перечисления.ПериодыНапоминаний.Завтра Тогда
		
		СледующееНапоминание = НачалоДня(ТекущаяДата() + 86400);
		
	ИначеЕсли НапомнитЕщеРаз = Перечисления.ПериодыНапоминаний.НаСледующейНедели Тогда
		
		СледующееНапоминание = НачалоНедели(ТекущаяДата() + 86400 * 7);
		
	ИначеЕсли НапомнитЕщеРаз = Перечисления.ПериодыНапоминаний.ВСледующемМесяце Тогда
		
		СледующееНапоминание = НачалоМесяца(КонецМесяца(ТекущаяДата()) + 1);
		
	ИначеЕсли НапомнитЕщеРаз = Перечисления.ПериодыНапоминаний.ВНовомГоду Тогда
		
		СледующееНапоминание = НачалоГода(КонецГода(ТекущаяДата()) + 1);
		
	Иначе
		
		СледующееНапоминание = ТекущаяДата() + Число(СтрЗаменить(Строка(НапомнитЕщеРаз.Метаданные().ЗначенияПеречисления[Перечисления.ПериодыНапоминаний.Индекс(НапомнитЕщеРаз)].Имя),"_","")) * 60;
		
	КонецЕсли;
	
КонецФункции

// ЗАПИСЬ

&НаСервере
Функция ЗаписатьОткрытие()
	
	текОбъект = Объект.Ссылка.ПолучитьОбъект();
	
	Если текОбъект <> Неопределено Тогда
		
		текОбъект.НапоминаниеОткрыл 	= ПараметрыСеанса.ТекущийПользователь;
		текОбъект.НапоминаниеОткрыто 	= ТекущаяДата();
		
		Попытка
			текОбъект.Записать();
		Исключение
			ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
&НаСервере
Функция ЗаписатьНапоминание()
	
	текОбъект = Объект.Ссылка.ПолучитьОбъект();
	
	Если текОбъект <> Неопределено Тогда
		
		текОбъект.ДатаНапоминания 		= СледующееНапоминание;
		текОбъект.НапоминаниеОткрыто 	= '00010101';
		текОбъект.НапоминаниеОткрыл 	= Справочники.Пользователи.ПустаяСсылка();
		
		Попытка
			текОбъект.Записать();
		Исключение
			ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
&НаСервере
Функция УдалитьНапоминание()
	
	текОбъект = Объект.Ссылка.ПолучитьОбъект();
	
	Если текОбъект <> Неопределено Тогда
		
		Попытка
			текОбъект.Удалить();
		Исключение
			ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// КНОПКИ

&НаКлиенте
Процедура ОткрытьИБольшеНеНапоминать(Команда)
	
	ОткрытьФорму("Задача.ЗадачаПользователю.ФормаОбъекта", Новый Структура("Ключ", Объект.Источник));
	УдалитьНапоминание();
	НапоминанияБольшеНет = Истина;
	Закрыть();
	
КонецПроцедуры
&НаКлиенте
Процедура НапомнитьПозже(Команда)
	
	ОпределитьВремяСледующегоНапоминания();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНадписьНажатие(Элемент)
	
	ОткрытьФорму("Задача.ЗадачаПользователю.ФормаОбъекта", Новый Структура("Ключ", Объект.Источник));
	Закрыть();
	
КонецПроцедуры
